{
  "message": {
    "p0":
    {
      "name": "Presto 1755 16-Quart Aluminum Pressure Cooker/Canner",
      "price": 129.99,
      "description": "Amazing Pressure Cooker, suitable for use on regular and smooth ranges, produced in China.",
      "category": 1
    },
    "p1":
    {
      "name": "Nordic Ware Restaurant Cookware 10-Inch Skillet",
      "price": 56.22,
      "description": "Cook the most delicious food in this Skillet with high heat-resistance handle.",
      "category": 1
    },
    "p2":
    {
      "name": "Asus ZenBook Ultra-Slim Laptop, 13.3 inches Full HD, 8th Gen Intel i5-8250U Processor, 8GB RAM, 256GB SSD, Backlit Keyboard, Fingerprint Reader, Anti-Glare, Windows 10, Grey, UX330UA-AH55",
      "price": 999.99,
      "description": "Great device to have if you need a good Laptop for a cheap price.",
      "category": 2
    },
    "p3":
    {
      "name": "VIZIO D24f-F1 24 inches 1080p Smart LED Television (2018), Black",
      "price": 549.99,
      "description": "This television has smart functionalities and produces images with outstanding quality.",
      "category": 2
    },
    "p4":
    {
      "name": "Playstation 4 - 1TB Slim - Console Edition",
      "price": 379.96,
      "description": "Can be used to play games, to listen to music and more!",
      "category": 3
    },
    "p5":
    {
      "name": "DualShock 4 Jet Black Controller - PlayStation 4 Jet Black Edition",
      "price": 74.99,
      "description": "The best controller for a Playstation 4",
      "category": 3
    },
    "p6":
    {
      "name": "Interstellar [Blu-ray]",
      "price": 22.99,
      "description": "In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand (Michael Caine), a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper (Matthew McConaughey) and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home.",
      "category": 4
    },
    "p7":
    {
      "name": "Amadeus",
      "price": 14.99,
      "description": "The life, success and troubles of Wolfgang Amadeus Mozart, as told by Antonio Salieri, the contemporary composer who was insanely jealous of Mozart's talent and claimed to have murdered him.",
      "category": 4
    },
    "p8":
    {
      "name": "Wilson WRT31160U3 Tennis Racket Energy XL",
      "price": 29.99,
      "description": "You cannot go wrong with this racket, designed to reduce racket vibration and greater the control",
      "category": 5
    },
    "p9":
    {
      "name": "Athletico 3 Racquet Tennis Bag | Padded to Protect Rackets & Lightweight | Professional Or Beginner Tennis Players | Unisex Design for Men, Women, Youth and Adults (Red)",
      "price": 29.99,
      "description": "Great to carry your tennis rackets around",
      "category": 5
    }
  }
}